<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Python_Data_Analytics_Course/blob/main/4_Problems/2_04_Pandas Pivot Tables.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

In [5]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

## ðŸŸ© Count Job Postings by Title and Country (2.4.1)

In [3]:
pivot = df.pivot_table(index = ['job_title_short', 'job_country'], aggfunc= 'size')
pivot.head(10)

job_title_short   job_country
Business Analyst  Afghanistan      4
                  Albania         11
                  Algeria         21
                  Angola           1
                  Argentina      453
                  Armenia         29
                  Australia      928
                  Austria        738
                  Azerbaijan      16
                  Bahamas          5
dtype: int64

---

## ðŸŸ¨ Salary Stats by Job Title (2.4.2)

In [6]:
df_salary_per_company = df.pivot_table( 
    values = 'salary_year_avg', 
    index = 'company_name',  
    aggfunc = ['min', 'max', 'mean']
)

df_salary_per_company.head(5)

                                    min             max            mean
                        salary_year_avg salary_year_avg salary_year_avg
company_name
#twiceasnice Recruiting    61000.000000   120000.000000    77750.000000
/dev/color                125000.000000   125000.000000   125000.000000
0nward Select              92500.000000    92500.000000    92500.000000
1 Point System            137290.484375   137290.484375   137290.484375
1 Point System LLC.       170000.000000   170000.000000   170000.000000

---

## ðŸŸ¥ Sum Salary by Title and Country (2.4.3)

In [9]:

df_filter = df[df['job_title_short'] == 'Data Scientist']

df_median_sal = df_filter.pivot_table (
    values= 'salary_year_avg',
    index = ['company_name', 'job_country'],
    aggfunc = 'median'
)

df_final = df_median_sal[df_median_sal['salary_year_avg'] > 20_000]

df_final.head(10).sort_values(by = 'salary_year_avg', ascending = False)

                                   salary_year_avg
company_name       job_country
2K                 Ireland                157500.0
                   United States          153750.0
1872 Consulting    Sudan                  145000.0
2U                 United States          135000.0
3M                 United States          128452.5
/dev/color         United States          125000.0
3B Staffing LLC    United States          120000.0
4 Corner Resources United States          114000.0
2K                 United Kingdom         105300.0
3Red Partners      United States          100000.0

---